[
  {
    "Title": "Putting on the Armor",
    "Author": "Chuck Lawless",
    "Description": "Putting on the Armor is an excellent 7-session study for new and growing believers seeking practical application of personal spiritual disciplines in order to defeat the enemy in times of temptation. This study does not offer \"cures\" for any temptation, but does lay out the path to victory for every believer. Author Chuck Lawless believes that Ephesians 6:10-20 gives us clear direction on how to fight the enemy and how to develop and demonstrate effective Christian living."
  },
  {
    "Title": "One on One with God",
    "Author": "Jerry & Marilyn Fine",
    "Description": "ONE on ONE with GOD is a fifteen-week process of discipleship training that connects you directly to God through prayer and reading His WORD."
  },
  {
    "Title": "What Every Christian Ought to Know",
    "Author": "Adrian Rogers",
    "Description": "Just as plants need certain essentials to grow--light, water, and fertile soil--so do new Christians--babes in the faith. Without these essentials--the basic truths of the faith--they will never establish strong roots or bear fruit.Adrian Rogers has written a book designed to give new believers the nurture and care their faith needs to blossom and grow. What Every Christian Ought to Know seeks to give intellectual truth, and also to provide the \"spiritual nutrients\" required to produce mature faith."
  },
  {
    "Title": "Transformational Groups",
    "Author": "Ed Stetzer & Eric Geiger",
    "Description": "In Transformational Groups, Ed Stetzer and Eric Geiger have created a new scorecard that will provide a map to transformational success for your church’s groups ministry. Using data from the largest survey of pastors and laypersons ever done on the condition of groups in the church, they define a simple process to lead your groups from where they are to where God wants them to be."
  },
  {
    "Title": "Living by the Book",
    "Author": "Howard G. Hendricks & William D. Hendricks",
    "Description": "Living by the Book will remove the barriers that keep Scripture from transforming your life. In a simple, step-by-step fashion, the authors explain how to glean truth from Scripture. It is practical, readable, and applicable. By following its easy-to-apply principles, you'll soon find yourself drawing great nourishment from the Word—and enjoying the process!"
  },
  {
    "Title": "Sharing Jesus Without Freaking Out",
    "Author": "Alvin L. Reid",
    "Description": "God created you for his glory to advance his gospel with the gifts, talents, and opportunities he gave you. You live at this time in history for a purpose bigger than yourself. In these pages you will read how to connect the gospel story with your story, and how to talk about that story in normal conversations with people you know. "
  },
  {
    "Title": "Humility",
    "Author": "C.J. Mahaney",
    "Description": "A battle rages within every one of us every day. It's the clash between our sense of stubborn self-sufficiency and God's call to recognize that we're really nothing without Him. It's pride versus humility. And it's a fight we can't win without looking repeatedly to Christ and the cross. C. J. Mahaney raises a battle cry to daily, diligently, and deliberately weaken our greatest enemy (pride) and cultivate our greatest friend (humility). His thorough examination clarifies misconceptions, revealing the truth about why God detests pride and turns His active attention to the humble. Because pride is never passive, defeating it demands an intentional attack. The blessing that follows is God's abundant favor."
  },
  {
    "Title": "Grace Walk",
    "Author": "Steve McVey",
    "Description": "Living the grace walk gets Christians off this religious roller coaster. Using his own journey from legalism into grace, Steve McVey illustrates the foundational, biblical truths of who believers are in Jesus Christ and how they can let Him live His life through them each day."
  },
  {
    "Title": "Cost of Discipleship",
    "Author": "Dietrich Bonheoffer",
    "Description": "Perhaps Dietrich Bonhoeffer's most radical book, this reading of the Sermon on the Mount has influenced many Christians throughout the world over the last 50 years."
  },
  {
    "Title": "Prodigal God",
    "Author": "Tim Keller",
    "Description": "In The Prodigal God, Keller takes his trademark intellectual approach to understanding Christianity and uses the parable of the prodigal son to reveal an unexpected message of hope and salvation. Within that parable Jesus reveals God's prodigal grace toward both the irreligious and the moralistic. This book will challenge both the devout and skeptics to see Christianity in a whole new way."
  },
  {
    "Title": "Everybody Always",
    "Author": "Bod Goff",
    "Description": "What if we stopped avoiding the difficult people in our lives and committed to simply loving everybody? What happens when we give away love like we're made of it? In Everybody, Always, Bob Goff's joyful New York Times bestselling follow-up to Love Does, you'll discover the secret to living without fear, constraint, or worry."
  },
  {
    "Title": "Tuesday's with Morrie",
    "Author": "Mitch Albom",
    "Description": "Tuesdays with Morrie is a memoir by American author Mitch Albom about a series of visits Albom made to his former sociology professor Morrie Schwartz, as Schwartz gradually dies of ALS."
  },
  {
    "Title": "Praying the Bible",
    "Author": "Don Whitney",
    "Description": "When you pray, does it ever feel like you're just saying the same old things about the same old things? Offering us the encouragement and the practical advice we're all looking for, Donald S. Whitney outlines an easy-to-grasp method that has the power to transform our prayer life: praying the words of Scripture. Simple, yet profound, Praying the Bible will prove invaluable as you seek to commune with your heavenly Father in prayer each and every day."
  },
  {
    "Title": "Mere Christianity",
    "Author": "C.S. Lewis",
    "Description": "In 1941 England, when all hope was threatened by the inhumanity of war, C.S. Lewis was invited to give a series of radio lectures addressing the central issues of Christianity. More than half a century later, these talks continue to retain their poignancy. First heard as informal radio broadcasts on the BBC, the lectures were published as three books and subsequently combined as Mere Christianity. C.S. Lewis proves that \"at the center of each there is something, or a Someone, who against all divergences of belief, all differences of temperament, all memories of mutual persecution, speaks with the same voice,\" rejecting the boundaries that divide Christianity's many denominations. This twentieth century masterpiece provides an unequaled opportunity for believers and nonbelievers alike to hear a powerful, rational case for the Christian faith."
  },
  {
    "Title": "The Case for Christ",
    "Author": "Lee Strobel",
    "Description": "The book consists primarily of interviews between Strobel (a former legal editor at the Chicago Tribune) and biblical scholars such as Bruce Metzger. Each interview is based on a simple question, concerning historical evidence (for example, \"Can the Biographies of Jesus Be Trusted?\"), scientific evidence, (\"Does Archaeology Confirm or Contradict Jesus' Biographies?\"), and \"psychiatric evidence\" (\"Was Jesus Crazy When He Claimed to Be the Son of God?\"). Together, these interviews compose a case brief defending Jesus' divinity, and urging readers to reach a verdict of their own."
  },
  {
    "Title": "The Bait of Satan",
    "Author": "John Bevere",
    "Description": "John Bevere shows you how to identify the traps ahead of you and escape the victim mentality. With declaration-style prayers and testimonials from people whose lives have been changed by his message, this book will inspire you to stay free from offense and its destructive power. Don't let anyone affect your relationship with God."
  },
  {
    "Title": "Unseen Realm",
    "Author": "Michael Heiser",
    "Description": "In The Unseen Realm, Dr. Michael Heiser examines the ancient context of Scripture, explaining how its supernatural worldview can help us grow in our understanding of God. He illuminates intriguing and amazing passages of the Bible that have been hiding in plain sight. You'll find yourself engaged in an enthusiastic pursuit of the truth, resulting in a new appreciation for God's Word."
  },
  {
    "Title": "Tactics, A Game plan for discussing your Christian convictions",
    "Author": "Greg Koukl",
    "Description": "In Tactics, Gregory Koukl demonstrates how to artfully regain control of conversations, keeping them moving forward in constructive ways through thoughtful diplomacy. You'll learn how to maneuver comfortably and graciously through the minefields of a challenging discussion, how to stop challengers in their tracks, and how to turn the tables on question or provocative statement. Most importantly, you'll learn how to get people thinking about Jesus."
  },
  {
    "Title": "Screwtape Letters",
    "Author": "CS Lewis",
    "Description": "The Screwtape Letters is a Christian apologetic novel by C. S. Lewis. It is written in a satirical, epistolary style and while it is fictional in format, the plot and characters are used to address Christian theological issues, primarily those to do with temptation and resistance to it. First published in February 1942, the story takes the form of a series of letters from a senior Demon Screwtape to his nephew Wormwood, a Junior Tempter. The uncle's mentorship pertains to the nephew's responsibility for securing the damnation of a British man known only as \"the Patient\"."
  },
  {
    "Title": "Spiritual Disciplines of the Christian Life",
    "Author": "Don Whitney",
    "Description": "We aren't meant to wait for holiness--we're meant to pursue it. God commands Christians to actively \"be holy,\" but what does that look like in daily life? Rather than overwhelming legalism or loose boundaries, Don Whitney encourages us to find a practical middle ground through biblical habits."
  },
  {
    "Title": "The Pundit's Folly (Ecclesiastes)",
    "Author": "Sinclair Ferguson",
    "Description": "Written specifically to help non-Christians, The Pundit's Folly is a tool for evangelism; but its biblical content and explanation of the Christian gospel will provide encouragement to those who are already Christians to witness to Christ and to live unreservedly for him."
  },
  {
    "Title": "Person of Interest",
    "Author": "J. Warner Wallace",
    "Description": "Can the truth about Jesus be uncovered--even without a body or a crime scene? Join cold-case detective and bestselling author J. Warner Wallace as he investigates Jesus using an innovative and unique approach he employs to solve real missing person murder cases."
  },
  {
    "Title": "On Guard",
    "Author": "William Lane Craig",
    "Description": "This one-stop, how-to-defend-your-faith manual will equip Christians to advance faith conversations deliberately, applying straightforward, cool-headed arguments. They will discover not just what they believe, but why they believe—and how being on guard with the truth has the power to change lives forever."
  },
  {
    "Title": "Reasonable Faith",
    "Author": "William Lane Craig",
    "Description": "His approach-that of positive apologetics-gives careful attention to crucial questions and concerns, including: the relationship of faith and reason, the existence of God, the problems of historical knowledge and miracles, the personal claims of Christ, and the historicity of the resurrection of Jesus. He shows that there is good reason to think Christianity is true. As Craig says, \"If you have a sound and persuasive case for Christianity, you don't have to become an expert in comparative religions and Christian cults. A positive justification of the Christian faith automatically overwhelms all competing world views lacking an equally strong case.\""
  },
  {
    "Title": "The Resurrection of Jesus: A New Historiographical Approach",
    "Author": "Mike Licona",
    "Description": "The question of the historicity of Jesus' resurrection has been repeatedly probed, investigated and debated. And the results have varied widely. Perhaps some now regard this issue as the burned-over district of New Testament scholarship. Could there be any new and promising approach to this problem? Yes, answers Michael Licona. And he convincingly points us to a significant deficiency in approaching this question: our historiographical orientation and practice."
  },
  {
    "Title": "The Case for the Resurrection of Jesus",
    "Author": "Gary Habermas & Mike Licona",
    "Description": "This is an accessible, comprehensive, and persuasive resource providing detailed evidence for the resurrection of Jesus. It also demonstrates how to share the material clearly, honestly, and definitively. Included is an interactive CD which tests the reader's knowledge of the material by using an entertaining TV game show format. \"There is nothing like this on the market. It is interesting, engaging, and crucial material.\""
  },
  {
    "Title": "Seeking Allah, Finding Jesus",
    "Author": "Nabeel Qureshi",
    "Description": "Nabeel Qureshi describes his dramatic journey from Islam to Christianity in this expanded edition with new bonus content and reflections."
  },
  {
    "Title": "The Reason for God",
    "Author": "Tim Keller",
    "Description": "Timothy Keller, the founding pastor of Redeemer Presbyterian Church in New York City, addresses the frequent doubts that skeptics, and even ardent believers, have about religion. Using literature, philosophy, real-life conversations, and potent reasoning, Keller explains how the belief in a Christian God is, in fact, a sound and rational one. To true believers he offers a solid platform on which to stand their ground against the backlash to religion created by the Age of Skepticism. And to skeptics, atheists, and agnostics, he provides a challenging argument for pursuing the reason for God."
  },
  {
    "Title": "Why Does God Allow Evil",
    "Author": "Clay Jones",
    "Description": "Clay Jones, an associate professor of Christian apologetics at Biola University, examines what Scripture truly says about the nature of evil and why God allows it. Along the way, he'll help you discover the contrasting abundance of God's grace, the overwhelming joy of heaven, and the extraordinary destiny of believers."
  },
  {
    "Title": "Is God a Moral Monster?",
    "Author": "Paul Copan",
    "Description": "In this timely and readable book, apologist Paul Copan takes on some of the most vexing accusations of our time, including: God is arrogant and jealous God punishes people too harshly God is guilty of ethnic cleansing God oppresses women God endorses slavery Christianity causes violence and more. Copan not only answers God's critics, he also shows how to read both the Old and New Testaments faithfully, seeing an unchanging, righteous, and loving God in both."
  }
]
